MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4104-F64F128/mcu.h
/* ---------------------------  SCU_GENERAL_MIRRALLSTAT  -------------------------- */
#define SCU_GENERAL_MIRRALLSTAT_BUSY_Pos      (0UL)                     /*!< SCU_GENERAL MIRRALLSTAT: BUSY (Bit 0)                       */
#define SCU_GENERAL_MIRRALLSTAT_BUSY_Msk      (0x1UL)                   /*!< SCU_GENERAL MIRRALLSTAT: BUSY (Bitfield-Mask: 0x01)         */

/* ---------------------------  SCU_GENERAL_MIRRALLREQ  --------------------------- */
#define SCU_GENERAL_MIRRALLREQ_REQ_Pos        (0UL)                     /*!< SCU_GENERAL MIRRALLREQ: REQ (Bit 0)                         */
#define SCU_GENERAL_MIRRALLREQ_REQ_Msk        (0x1UL)                   /*!< SCU_GENERAL MIRRALLREQ: REQ (Bitfield-Mask: 0x01)           */


/* ================================================================================ */
/* ================     struct 'SCU_INTERRUPT' Position & Mask     ================ */
/* ================================================================================ */


/* ----------------------------  SCU_INTERRUPT_SRSTAT  ---------------------------- */
#define SCU_INTERRUPT_SRSTAT_PRWARN_Pos       (0UL)                     /*!< SCU_INTERRUPT SRSTAT: PRWARN (Bit 0)                        */
#define SCU_INTERRUPT_SRSTAT_PRWARN_Msk       (0x1UL)                   /*!< SCU_INTERRUPT SRSTAT: PRWARN (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRSTAT_PI_Pos           (1UL)                     /*!< SCU_INTERRUPT SRSTAT: PI (Bit 1)                            */
#define SCU_INTERRUPT_SRSTAT_PI_Msk           (0x2UL)                   /*!< SCU_INTERRUPT SRSTAT: PI (Bitfield-Mask: 0x01)              */
#define SCU_INTERRUPT_SRSTAT_AI_Pos           (2UL)                     /*!< SCU_INTERRUPT SRSTAT: AI (Bit 2)                            */
#define SCU_INTERRUPT_SRSTAT_AI_Msk           (0x4UL)                   /*!< SCU_INTERRUPT SRSTAT: AI (Bitfield-Mask: 0x01)              */
#define SCU_INTERRUPT_SRSTAT_DLROVR_Pos       (3UL)                     /*!< SCU_INTERRUPT SRSTAT: DLROVR (Bit 3)                        */
#define SCU_INTERRUPT_SRSTAT_DLROVR_Msk       (0x8UL)                   /*!< SCU_INTERRUPT SRSTAT: DLROVR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRSTAT_LPACCR_Pos       (6UL)                     /*!< SCU_INTERRUPT SRSTAT: LPACCR (Bit 6)                        */
#define SCU_INTERRUPT_SRSTAT_LPACCR_Msk       (0x40UL)                  /*!< SCU_INTERRUPT SRSTAT: LPACCR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRSTAT_LPACTH0_Pos      (7UL)                     /*!< SCU_INTERRUPT SRSTAT: LPACTH0 (Bit 7)                       */
#define SCU_INTERRUPT_SRSTAT_LPACTH0_Msk      (0x80UL)                  /*!< SCU_INTERRUPT SRSTAT: LPACTH0 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRSTAT_LPACTH1_Pos      (8UL)                     /*!< SCU_INTERRUPT SRSTAT: LPACTH1 (Bit 8)                       */
#define SCU_INTERRUPT_SRSTAT_LPACTH1_Msk      (0x100UL)                 /*!< SCU_INTERRUPT SRSTAT: LPACTH1 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRSTAT_LPACST_Pos       (9UL)                     /*!< SCU_INTERRUPT SRSTAT: LPACST (Bit 9)                        */
#define SCU_INTERRUPT_SRSTAT_LPACST_Msk       (0x200UL)                 /*!< SCU_INTERRUPT SRSTAT: LPACST (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRSTAT_LPACCLR_Pos      (10UL)                    /*!< SCU_INTERRUPT SRSTAT: LPACCLR (Bit 10)                      */
#define SCU_INTERRUPT_SRSTAT_LPACCLR_Msk      (0x400UL)                 /*!< SCU_INTERRUPT SRSTAT: LPACCLR (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRSTAT_LPACSET_Pos      (11UL)                    /*!< SCU_INTERRUPT SRSTAT: LPACSET (Bit 11)                      */
#define SCU_INTERRUPT_SRSTAT_LPACSET_Msk      (0x800UL)                 /*!< SCU_INTERRUPT SRSTAT: LPACSET (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRSTAT_HINTST_Pos       (12UL)                    /*!< SCU_INTERRUPT SRSTAT: HINTST (Bit 12)                       */
#define SCU_INTERRUPT_SRSTAT_HINTST_Msk       (0x1000UL)                /*!< SCU_INTERRUPT SRSTAT: HINTST (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRSTAT_HINTCLR_Pos      (13UL)                    /*!< SCU_INTERRUPT SRSTAT: HINTCLR (Bit 13)                      */
#define SCU_INTERRUPT_SRSTAT_HINTCLR_Msk      (0x2000UL)                /*!< SCU_INTERRUPT SRSTAT: HINTCLR (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRSTAT_HINTSET_Pos      (14UL)                    /*!< SCU_INTERRUPT SRSTAT: HINTSET (Bit 14)                      */
#define SCU_INTERRUPT_SRSTAT_HINTSET_Msk      (0x4000UL)                /*!< SCU_INTERRUPT SRSTAT: HINTSET (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRSTAT_HDCLR_Pos        (17UL)                    /*!< SCU_INTERRUPT SRSTAT: HDCLR (Bit 17)                        */
#define SCU_INTERRUPT_SRSTAT_HDCLR_Msk        (0x20000UL)               /*!< SCU_INTERRUPT SRSTAT: HDCLR (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRSTAT_HDSET_Pos        (18UL)                    /*!< SCU_INTERRUPT SRSTAT: HDSET (Bit 18)                        */
#define SCU_INTERRUPT_SRSTAT_HDSET_Msk        (0x40000UL)               /*!< SCU_INTERRUPT SRSTAT: HDSET (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRSTAT_HDCR_Pos         (19UL)                    /*!< SCU_INTERRUPT SRSTAT: HDCR (Bit 19)                         */
#define SCU_INTERRUPT_SRSTAT_HDCR_Msk         (0x80000UL)               /*!< SCU_INTERRUPT SRSTAT: HDCR (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRSTAT_OSCSICTRL_Pos    (21UL)                    /*!< SCU_INTERRUPT SRSTAT: OSCSICTRL (Bit 21)                    */
#define SCU_INTERRUPT_SRSTAT_OSCSICTRL_Msk    (0x200000UL)              /*!< SCU_INTERRUPT SRSTAT: OSCSICTRL (Bitfield-Mask: 0x01)       */
#define SCU_INTERRUPT_SRSTAT_OSCULCTRL_Pos    (23UL)                    /*!< SCU_INTERRUPT SRSTAT: OSCULCTRL (Bit 23)                    */
#define SCU_INTERRUPT_SRSTAT_OSCULCTRL_Msk    (0x800000UL)              /*!< SCU_INTERRUPT SRSTAT: OSCULCTRL (Bitfield-Mask: 0x01)       */
#define SCU_INTERRUPT_SRSTAT_RTC_CTR_Pos      (24UL)                    /*!< SCU_INTERRUPT SRSTAT: RTC_CTR (Bit 24)                      */
#define SCU_INTERRUPT_SRSTAT_RTC_CTR_Msk      (0x1000000UL)             /*!< SCU_INTERRUPT SRSTAT: RTC_CTR (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRSTAT_RTC_ATIM0_Pos    (25UL)                    /*!< SCU_INTERRUPT SRSTAT: RTC_ATIM0 (Bit 25)                    */
#define SCU_INTERRUPT_SRSTAT_RTC_ATIM0_Msk    (0x2000000UL)             /*!< SCU_INTERRUPT SRSTAT: RTC_ATIM0 (Bitfield-Mask: 0x01)       */
#define SCU_INTERRUPT_SRSTAT_RTC_ATIM1_Pos    (26UL)                    /*!< SCU_INTERRUPT SRSTAT: RTC_ATIM1 (Bit 26)                    */
#define SCU_INTERRUPT_SRSTAT_RTC_ATIM1_Msk    (0x4000000UL)             /*!< SCU_INTERRUPT SRSTAT: RTC_ATIM1 (Bitfield-Mask: 0x01)       */
#define SCU_INTERRUPT_SRSTAT_RTC_TIM0_Pos     (27UL)                    /*!< SCU_INTERRUPT SRSTAT: RTC_TIM0 (Bit 27)                     */
#define SCU_INTERRUPT_SRSTAT_RTC_TIM0_Msk     (0x8000000UL)             /*!< SCU_INTERRUPT SRSTAT: RTC_TIM0 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRSTAT_RTC_TIM1_Pos     (28UL)                    /*!< SCU_INTERRUPT SRSTAT: RTC_TIM1 (Bit 28)                     */
#define SCU_INTERRUPT_SRSTAT_RTC_TIM1_Msk     (0x10000000UL)            /*!< SCU_INTERRUPT SRSTAT: RTC_TIM1 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRSTAT_RMX_Pos          (29UL)                    /*!< SCU_INTERRUPT SRSTAT: RMX (Bit 29)                          */
#define SCU_INTERRUPT_SRSTAT_RMX_Msk          (0x20000000UL)            /*!< SCU_INTERRUPT SRSTAT: RMX (Bitfield-Mask: 0x01)             */

/* -----------------------------  SCU_INTERRUPT_SRRAW  ---------------------------- */
#define SCU_INTERRUPT_SRRAW_PRWARN_Pos        (0UL)                     /*!< SCU_INTERRUPT SRRAW: PRWARN (Bit 0)                         */
#define SCU_INTERRUPT_SRRAW_PRWARN_Msk        (0x1UL)                   /*!< SCU_INTERRUPT SRRAW: PRWARN (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_PI_Pos            (1UL)                     /*!< SCU_INTERRUPT SRRAW: PI (Bit 1)                             */
#define SCU_INTERRUPT_SRRAW_PI_Msk            (0x2UL)                   /*!< SCU_INTERRUPT SRRAW: PI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRRAW_AI_Pos            (2UL)                     /*!< SCU_INTERRUPT SRRAW: AI (Bit 2)                             */
#define SCU_INTERRUPT_SRRAW_AI_Msk            (0x4UL)                   /*!< SCU_INTERRUPT SRRAW: AI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRRAW_DLROVR_Pos        (3UL)                     /*!< SCU_INTERRUPT SRRAW: DLROVR (Bit 3)                         */
#define SCU_INTERRUPT_SRRAW_DLROVR_Msk        (0x8UL)                   /*!< SCU_INTERRUPT SRRAW: DLROVR (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_LPACCR_Pos        (6UL)                     /*!< SCU_INTERRUPT SRRAW: LPACCR (Bit 6)                         */
#define SCU_INTERRUPT_SRRAW_LPACCR_Msk        (0x40UL)                  /*!< SCU_INTERRUPT SRRAW: LPACCR (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_LPACTH0_Pos       (7UL)                     /*!< SCU_INTERRUPT SRRAW: LPACTH0 (Bit 7)                        */
#define SCU_INTERRUPT_SRRAW_LPACTH0_Msk       (0x80UL)                  /*!< SCU_INTERRUPT SRRAW: LPACTH0 (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_LPACTH1_Pos       (8UL)                     /*!< SCU_INTERRUPT SRRAW: LPACTH1 (Bit 8)                        */
#define SCU_INTERRUPT_SRRAW_LPACTH1_Msk       (0x100UL)                 /*!< SCU_INTERRUPT SRRAW: LPACTH1 (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_LPACST_Pos        (9UL)                     /*!< SCU_INTERRUPT SRRAW: LPACST (Bit 9)                         */
#define SCU_INTERRUPT_SRRAW_LPACST_Msk        (0x200UL)                 /*!< SCU_INTERRUPT SRRAW: LPACST (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_LPACCLR_Pos       (10UL)                    /*!< SCU_INTERRUPT SRRAW: LPACCLR (Bit 10)                       */
#define SCU_INTERRUPT_SRRAW_LPACCLR_Msk       (0x400UL)                 /*!< SCU_INTERRUPT SRRAW: LPACCLR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_LPACSET_Pos       (11UL)                    /*!< SCU_INTERRUPT SRRAW: LPACSET (Bit 11)                       */
#define SCU_INTERRUPT_SRRAW_LPACSET_Msk       (0x800UL)                 /*!< SCU_INTERRUPT SRRAW: LPACSET (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_HINTST_Pos        (12UL)                    /*!< SCU_INTERRUPT SRRAW: HINTST (Bit 12)                        */
#define SCU_INTERRUPT_SRRAW_HINTST_Msk        (0x1000UL)                /*!< SCU_INTERRUPT SRRAW: HINTST (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_HINTCLR_Pos       (13UL)                    /*!< SCU_INTERRUPT SRRAW: HINTCLR (Bit 13)                       */
#define SCU_INTERRUPT_SRRAW_HINTCLR_Msk       (0x2000UL)                /*!< SCU_INTERRUPT SRRAW: HINTCLR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_HINTSET_Pos       (14UL)                    /*!< SCU_INTERRUPT SRRAW: HINTSET (Bit 14)                       */
#define SCU_INTERRUPT_SRRAW_HINTSET_Msk       (0x4000UL)                /*!< SCU_INTERRUPT SRRAW: HINTSET (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_HDCLR_Pos         (17UL)                    /*!< SCU_INTERRUPT SRRAW: HDCLR (Bit 17)                         */
#define SCU_INTERRUPT_SRRAW_HDCLR_Msk         (0x20000UL)               /*!< SCU_INTERRUPT SRRAW: HDCLR (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_HDSET_Pos         (18UL)                    /*!< SCU_INTERRUPT SRRAW: HDSET (Bit 18)                         */
#define SCU_INTERRUPT_SRRAW_HDSET_Msk         (0x40000UL)               /*!< SCU_INTERRUPT SRRAW: HDSET (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_HDCR_Pos          (19UL)                    /*!< SCU_INTERRUPT SRRAW: HDCR (Bit 19)                          */
#define SCU_INTERRUPT_SRRAW_HDCR_Msk          (0x80000UL)               /*!< SCU_INTERRUPT SRRAW: HDCR (Bitfield-Mask: 0x01)             */
#define SCU_INTERRUPT_SRRAW_OSCSICTRL_Pos     (21UL)                    /*!< SCU_INTERRUPT SRRAW: OSCSICTRL (Bit 21)                     */
#define SCU_INTERRUPT_SRRAW_OSCSICTRL_Msk     (0x200000UL)              /*!< SCU_INTERRUPT SRRAW: OSCSICTRL (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRRAW_OSCULCTRL_Pos     (23UL)                    /*!< SCU_INTERRUPT SRRAW: OSCULCTRL (Bit 23)                     */
#define SCU_INTERRUPT_SRRAW_OSCULCTRL_Msk     (0x800000UL)              /*!< SCU_INTERRUPT SRRAW: OSCULCTRL (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRRAW_RTC_CTR_Pos       (24UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_CTR (Bit 24)                       */
#define SCU_INTERRUPT_SRRAW_RTC_CTR_Msk       (0x1000000UL)             /*!< SCU_INTERRUPT SRRAW: RTC_CTR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM0_Pos     (25UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_ATIM0 (Bit 25)                     */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM0_Msk     (0x2000000UL)             /*!< SCU_INTERRUPT SRRAW: RTC_ATIM0 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM1_Pos     (26UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_ATIM1 (Bit 26)                     */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM1_Msk     (0x4000000UL)             /*!< SCU_INTERRUPT SRRAW: RTC_ATIM1 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRRAW_RTC_TIM0_Pos      (27UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_TIM0 (Bit 27)                      */
#define SCU_INTERRUPT_SRRAW_RTC_TIM0_Msk      (0x8000000UL)             /*!< SCU_INTERRUPT SRRAW: RTC_TIM0 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRRAW_RTC_TIM1_Pos      (28UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_TIM1 (Bit 28)                      */
#define SCU_INTERRUPT_SRRAW_RTC_TIM1_Msk      (0x10000000UL)            /*!< SCU_INTERRUPT SRRAW: RTC_TIM1 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRRAW_RMX_Pos           (29UL)                    /*!< SCU_INTERRUPT SRRAW: RMX (Bit 29)                           */
#define SCU_INTERRUPT_SRRAW_RMX_Msk           (0x20000000UL)            /*!< SCU_INTERRUPT SRRAW: RMX (Bitfield-Mask: 0x01)              */

/* -----------------------------  SCU_INTERRUPT_SRMSK  ---------------------------- */
#define SCU_INTERRUPT_SRMSK_PRWARN_Pos        (0UL)                     /*!< SCU_INTERRUPT SRMSK: PRWARN (Bit 0)                         */
#define SCU_INTERRUPT_SRMSK_PRWARN_Msk        (0x1UL)                   /*!< SCU_INTERRUPT SRMSK: PRWARN (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_PI_Pos            (1UL)                     /*!< SCU_INTERRUPT SRMSK: PI (Bit 1)                             */
#define SCU_INTERRUPT_SRMSK_PI_Msk            (0x2UL)                   /*!< SCU_INTERRUPT SRMSK: PI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRMSK_AI_Pos            (2UL)                     /*!< SCU_INTERRUPT SRMSK: AI (Bit 2)                             */
#define SCU_INTERRUPT_SRMSK_AI_Msk            (0x4UL)                   /*!< SCU_INTERRUPT SRMSK: AI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRMSK_DLROVR_Pos        (3UL)                     /*!< SCU_INTERRUPT SRMSK: DLROVR (Bit 3)                         */
#define SCU_INTERRUPT_SRMSK_DLROVR_Msk        (0x8UL)                   /*!< SCU_INTERRUPT SRMSK: DLROVR (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_LPACCR_Pos        (6UL)                     /*!< SCU_INTERRUPT SRMSK: LPACCR (Bit 6)                         */
#define SCU_INTERRUPT_SRMSK_LPACCR_Msk        (0x40UL)                  /*!< SCU_INTERRUPT SRMSK: LPACCR (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_LPACTH0_Pos       (7UL)                     /*!< SCU_INTERRUPT SRMSK: LPACTH0 (Bit 7)                        */
#define SCU_INTERRUPT_SRMSK_LPACTH0_Msk       (0x80UL)                  /*!< SCU_INTERRUPT SRMSK: LPACTH0 (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_LPACTH1_Pos       (8UL)                     /*!< SCU_INTERRUPT SRMSK: LPACTH1 (Bit 8)                        */
#define SCU_INTERRUPT_SRMSK_LPACTH1_Msk       (0x100UL)                 /*!< SCU_INTERRUPT SRMSK: LPACTH1 (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_LPACST_Pos        (9UL)                     /*!< SCU_INTERRUPT SRMSK: LPACST (Bit 9)                         */
#define SCU_INTERRUPT_SRMSK_LPACST_Msk        (0x200UL)                 /*!< SCU_INTERRUPT SRMSK: LPACST (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_LPACCLR_Pos       (10UL)                    /*!< SCU_INTERRUPT SRMSK: LPACCLR (Bit 10)                       */
#define SCU_INTERRUPT_SRMSK_LPACCLR_Msk       (0x400UL)                 /*!< SCU_INTERRUPT SRMSK: LPACCLR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_LPACSET_Pos       (11UL)                    /*!< SCU_INTERRUPT SRMSK: LPACSET (Bit 11)                       */
#define SCU_INTERRUPT_SRMSK_LPACSET_Msk       (0x800UL)                 /*!< SCU_INTERRUPT SRMSK: LPACSET (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_HINTST_Pos        (12UL)                    /*!< SCU_INTERRUPT SRMSK: HINTST (Bit 12)                        */
#define SCU_INTERRUPT_SRMSK_HINTST_Msk        (0x1000UL)                /*!< SCU_INTERRUPT SRMSK: HINTST (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_HINTCLR_Pos       (13UL)                    /*!< SCU_INTERRUPT SRMSK: HINTCLR (Bit 13)                       */
#define SCU_INTERRUPT_SRMSK_HINTCLR_Msk       (0x2000UL)                /*!< SCU_INTERRUPT SRMSK: HINTCLR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_HINTSET_Pos       (14UL)                    /*!< SCU_INTERRUPT SRMSK: HINTSET (Bit 14)                       */
#define SCU_INTERRUPT_SRMSK_HINTSET_Msk       (0x4000UL)                /*!< SCU_INTERRUPT SRMSK: HINTSET (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_HDCLR_Pos         (17UL)                    /*!< SCU_INTERRUPT SRMSK: HDCLR (Bit 17)                         */
#define SCU_INTERRUPT_SRMSK_HDCLR_Msk         (0x20000UL)               /*!< SCU_INTERRUPT SRMSK: HDCLR (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_HDSET_Pos         (18UL)                    /*!< SCU_INTERRUPT SRMSK: HDSET (Bit 18)                         */
#define SCU_INTERRUPT_SRMSK_HDSET_Msk         (0x40000UL)               /*!< SCU_INTERRUPT SRMSK: HDSET (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_HDCR_Pos          (19UL)                    /*!< SCU_INTERRUPT SRMSK: HDCR (Bit 19)                          */
#define SCU_INTERRUPT_SRMSK_HDCR_Msk          (0x80000UL)               /*!< SCU_INTERRUPT SRMSK: HDCR (Bitfield-Mask: 0x01)             */
#define SCU_INTERRUPT_SRMSK_OSCSICTRL_Pos     (21UL)                    /*!< SCU_INTERRUPT SRMSK: OSCSICTRL (Bit 21)                     */
#define SCU_INTERRUPT_SRMSK_OSCSICTRL_Msk     (0x200000UL)              /*!< SCU_INTERRUPT SRMSK: OSCSICTRL (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRMSK_OSCULCTRL_Pos     (23UL)                    /*!< SCU_INTERRUPT SRMSK: OSCULCTRL (Bit 23)                     */
#define SCU_INTERRUPT_SRMSK_OSCULCTRL_Msk     (0x800000UL)              /*!< SCU_INTERRUPT SRMSK: OSCULCTRL (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRMSK_RTC_CTR_Pos       (24UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_CTR (Bit 24)                       */
#define SCU_INTERRUPT_SRMSK_RTC_CTR_Msk       (0x1000000UL)             /*!< SCU_INTERRUPT SRMSK: RTC_CTR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_RTC_ATIM0_Pos     (25UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_ATIM0 (Bit 25)                     */
#define SCU_INTERRUPT_SRMSK_RTC_ATIM0_Msk     (0x2000000UL)             /*!< SCU_INTERRUPT SRMSK: RTC_ATIM0 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRMSK_RTC_ATIM1_Pos     (26UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_ATIM1 (Bit 26)                     */
#define SCU_INTERRUPT_SRMSK_RTC_ATIM1_Msk     (0x4000000UL)             /*!< SCU_INTERRUPT SRMSK: RTC_ATIM1 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRMSK_RTC_TIM0_Pos      (27UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_TIM0 (Bit 27)                      */
#define SCU_INTERRUPT_SRMSK_RTC_TIM0_Msk      (0x8000000UL)             /*!< SCU_INTERRUPT SRMSK: RTC_TIM0 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRMSK_RTC_TIM1_Pos      (28UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_TIM1 (Bit 28)                      */
#define SCU_INTERRUPT_SRMSK_RTC_TIM1_Msk      (0x10000000UL)            /*!< SCU_INTERRUPT SRMSK: RTC_TIM1 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRMSK_RMX_Pos           (29UL)                    /*!< SCU_INTERRUPT SRMSK: RMX (Bit 29)                           */
#define SCU_INTERRUPT_SRMSK_RMX_Msk           (0x20000000UL)            /*!< SCU_INTERRUPT SRMSK: RMX (Bitfield-Mask: 0x01)              */

