MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4104-F64F128/mcu.h
/* -----------------------------  SCU_INTERRUPT_SRCLR  ---------------------------- */
#define SCU_INTERRUPT_SRCLR_PRWARN_Pos        (0UL)                     /*!< SCU_INTERRUPT SRCLR: PRWARN (Bit 0)                         */
#define SCU_INTERRUPT_SRCLR_PRWARN_Msk        (0x1UL)                   /*!< SCU_INTERRUPT SRCLR: PRWARN (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_PI_Pos            (1UL)                     /*!< SCU_INTERRUPT SRCLR: PI (Bit 1)                             */
#define SCU_INTERRUPT_SRCLR_PI_Msk            (0x2UL)                   /*!< SCU_INTERRUPT SRCLR: PI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRCLR_AI_Pos            (2UL)                     /*!< SCU_INTERRUPT SRCLR: AI (Bit 2)                             */
#define SCU_INTERRUPT_SRCLR_AI_Msk            (0x4UL)                   /*!< SCU_INTERRUPT SRCLR: AI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRCLR_DLROVR_Pos        (3UL)                     /*!< SCU_INTERRUPT SRCLR: DLROVR (Bit 3)                         */
#define SCU_INTERRUPT_SRCLR_DLROVR_Msk        (0x8UL)                   /*!< SCU_INTERRUPT SRCLR: DLROVR (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_LPACCR_Pos        (6UL)                     /*!< SCU_INTERRUPT SRCLR: LPACCR (Bit 6)                         */
#define SCU_INTERRUPT_SRCLR_LPACCR_Msk        (0x40UL)                  /*!< SCU_INTERRUPT SRCLR: LPACCR (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_LPACTH0_Pos       (7UL)                     /*!< SCU_INTERRUPT SRCLR: LPACTH0 (Bit 7)                        */
#define SCU_INTERRUPT_SRCLR_LPACTH0_Msk       (0x80UL)                  /*!< SCU_INTERRUPT SRCLR: LPACTH0 (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_LPACTH1_Pos       (8UL)                     /*!< SCU_INTERRUPT SRCLR: LPACTH1 (Bit 8)                        */
#define SCU_INTERRUPT_SRCLR_LPACTH1_Msk       (0x100UL)                 /*!< SCU_INTERRUPT SRCLR: LPACTH1 (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_LPACST_Pos        (9UL)                     /*!< SCU_INTERRUPT SRCLR: LPACST (Bit 9)                         */
#define SCU_INTERRUPT_SRCLR_LPACST_Msk        (0x200UL)                 /*!< SCU_INTERRUPT SRCLR: LPACST (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_LPACCLR_Pos       (10UL)                    /*!< SCU_INTERRUPT SRCLR: LPACCLR (Bit 10)                       */
#define SCU_INTERRUPT_SRCLR_LPACCLR_Msk       (0x400UL)                 /*!< SCU_INTERRUPT SRCLR: LPACCLR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_LPACSET_Pos       (11UL)                    /*!< SCU_INTERRUPT SRCLR: LPACSET (Bit 11)                       */
#define SCU_INTERRUPT_SRCLR_LPACSET_Msk       (0x800UL)                 /*!< SCU_INTERRUPT SRCLR: LPACSET (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_HINTST_Pos        (12UL)                    /*!< SCU_INTERRUPT SRCLR: HINTST (Bit 12)                        */
#define SCU_INTERRUPT_SRCLR_HINTST_Msk        (0x1000UL)                /*!< SCU_INTERRUPT SRCLR: HINTST (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_HINTCLR_Pos       (13UL)                    /*!< SCU_INTERRUPT SRCLR: HINTCLR (Bit 13)                       */
#define SCU_INTERRUPT_SRCLR_HINTCLR_Msk       (0x2000UL)                /*!< SCU_INTERRUPT SRCLR: HINTCLR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_HINTSET_Pos       (14UL)                    /*!< SCU_INTERRUPT SRCLR: HINTSET (Bit 14)                       */
#define SCU_INTERRUPT_SRCLR_HINTSET_Msk       (0x4000UL)                /*!< SCU_INTERRUPT SRCLR: HINTSET (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_HDCLR_Pos         (17UL)                    /*!< SCU_INTERRUPT SRCLR: HDCLR (Bit 17)                         */
#define SCU_INTERRUPT_SRCLR_HDCLR_Msk         (0x20000UL)               /*!< SCU_INTERRUPT SRCLR: HDCLR (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_HDSET_Pos         (18UL)                    /*!< SCU_INTERRUPT SRCLR: HDSET (Bit 18)                         */
#define SCU_INTERRUPT_SRCLR_HDSET_Msk         (0x40000UL)               /*!< SCU_INTERRUPT SRCLR: HDSET (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_HDCR_Pos          (19UL)                    /*!< SCU_INTERRUPT SRCLR: HDCR (Bit 19)                          */
#define SCU_INTERRUPT_SRCLR_HDCR_Msk          (0x80000UL)               /*!< SCU_INTERRUPT SRCLR: HDCR (Bitfield-Mask: 0x01)             */
#define SCU_INTERRUPT_SRCLR_OSCSICTRL_Pos     (21UL)                    /*!< SCU_INTERRUPT SRCLR: OSCSICTRL (Bit 21)                     */
#define SCU_INTERRUPT_SRCLR_OSCSICTRL_Msk     (0x200000UL)              /*!< SCU_INTERRUPT SRCLR: OSCSICTRL (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRCLR_OSCULCTRL_Pos     (23UL)                    /*!< SCU_INTERRUPT SRCLR: OSCULCTRL (Bit 23)                     */
#define SCU_INTERRUPT_SRCLR_OSCULCTRL_Msk     (0x800000UL)              /*!< SCU_INTERRUPT SRCLR: OSCULCTRL (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRCLR_RTC_CTR_Pos       (24UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_CTR (Bit 24)                       */
#define SCU_INTERRUPT_SRCLR_RTC_CTR_Msk       (0x1000000UL)             /*!< SCU_INTERRUPT SRCLR: RTC_CTR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_RTC_ATIM0_Pos     (25UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_ATIM0 (Bit 25)                     */
#define SCU_INTERRUPT_SRCLR_RTC_ATIM0_Msk     (0x2000000UL)             /*!< SCU_INTERRUPT SRCLR: RTC_ATIM0 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRCLR_RTC_ATIM1_Pos     (26UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_ATIM1 (Bit 26)                     */
#define SCU_INTERRUPT_SRCLR_RTC_ATIM1_Msk     (0x4000000UL)             /*!< SCU_INTERRUPT SRCLR: RTC_ATIM1 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRCLR_RTC_TIM0_Pos      (27UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_TIM0 (Bit 27)                      */
#define SCU_INTERRUPT_SRCLR_RTC_TIM0_Msk      (0x8000000UL)             /*!< SCU_INTERRUPT SRCLR: RTC_TIM0 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRCLR_RTC_TIM1_Pos      (28UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_TIM1 (Bit 28)                      */
#define SCU_INTERRUPT_SRCLR_RTC_TIM1_Msk      (0x10000000UL)            /*!< SCU_INTERRUPT SRCLR: RTC_TIM1 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRCLR_RMX_Pos           (29UL)                    /*!< SCU_INTERRUPT SRCLR: RMX (Bit 29)                           */
#define SCU_INTERRUPT_SRCLR_RMX_Msk           (0x20000000UL)            /*!< SCU_INTERRUPT SRCLR: RMX (Bitfield-Mask: 0x01)              */

