MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4104-F64F128/mcu.h
/* -------------------------------  HRPWM0_CSG1_CC  ------------------------------- */
#define HRPWM0_CSG1_CC_IBS_Pos                (0UL)                     /*!< HRPWM0_CSG1 CC: IBS (Bit 0)                                 */
#define HRPWM0_CSG1_CC_IBS_Msk                (0xfUL)                   /*!< HRPWM0_CSG1 CC: IBS (Bitfield-Mask: 0x0f)                   */
#define HRPWM0_CSG1_CC_IMCS_Pos               (8UL)                     /*!< HRPWM0_CSG1 CC: IMCS (Bit 8)                                */
#define HRPWM0_CSG1_CC_IMCS_Msk               (0x100UL)                 /*!< HRPWM0_CSG1 CC: IMCS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG1_CC_IMCC_Pos               (9UL)                     /*!< HRPWM0_CSG1 CC: IMCC (Bit 9)                                */
#define HRPWM0_CSG1_CC_IMCC_Msk               (0x600UL)                 /*!< HRPWM0_CSG1 CC: IMCC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_CC_ESE_Pos                (11UL)                    /*!< HRPWM0_CSG1 CC: ESE (Bit 11)                                */
#define HRPWM0_CSG1_CC_ESE_Msk                (0x800UL)                 /*!< HRPWM0_CSG1 CC: ESE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG1_CC_OIE_Pos                (12UL)                    /*!< HRPWM0_CSG1 CC: OIE (Bit 12)                                */
#define HRPWM0_CSG1_CC_OIE_Msk                (0x1000UL)                /*!< HRPWM0_CSG1 CC: OIE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG1_CC_OSE_Pos                (13UL)                    /*!< HRPWM0_CSG1 CC: OSE (Bit 13)                                */
#define HRPWM0_CSG1_CC_OSE_Msk                (0x2000UL)                /*!< HRPWM0_CSG1 CC: OSE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG1_CC_BLMC_Pos               (14UL)                    /*!< HRPWM0_CSG1 CC: BLMC (Bit 14)                               */
#define HRPWM0_CSG1_CC_BLMC_Msk               (0xc000UL)                /*!< HRPWM0_CSG1 CC: BLMC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG1_CC_EBE_Pos                (16UL)                    /*!< HRPWM0_CSG1 CC: EBE (Bit 16)                                */
#define HRPWM0_CSG1_CC_EBE_Msk                (0x10000UL)               /*!< HRPWM0_CSG1 CC: EBE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG1_CC_COFE_Pos               (17UL)                    /*!< HRPWM0_CSG1 CC: COFE (Bit 17)                               */
#define HRPWM0_CSG1_CC_COFE_Msk               (0x20000UL)               /*!< HRPWM0_CSG1 CC: COFE (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG1_CC_COFM_Pos               (18UL)                    /*!< HRPWM0_CSG1 CC: COFM (Bit 18)                               */
#define HRPWM0_CSG1_CC_COFM_Msk               (0x3c0000UL)              /*!< HRPWM0_CSG1 CC: COFM (Bitfield-Mask: 0x0f)                  */
#define HRPWM0_CSG1_CC_COFC_Pos               (24UL)                    /*!< HRPWM0_CSG1 CC: COFC (Bit 24)                               */
#define HRPWM0_CSG1_CC_COFC_Msk               (0x3000000UL)             /*!< HRPWM0_CSG1 CC: COFC (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG1_PLC  ------------------------------ */
#define HRPWM0_CSG1_PLC_IPLS_Pos              (0UL)                     /*!< HRPWM0_CSG1 PLC: IPLS (Bit 0)                               */
#define HRPWM0_CSG1_PLC_IPLS_Msk              (0xfUL)                   /*!< HRPWM0_CSG1 PLC: IPLS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG1_PLC_PLCL_Pos              (8UL)                     /*!< HRPWM0_CSG1 PLC: PLCL (Bit 8)                               */
#define HRPWM0_CSG1_PLC_PLCL_Msk              (0x300UL)                 /*!< HRPWM0_CSG1 PLC: PLCL (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG1_PLC_PSL_Pos               (10UL)                    /*!< HRPWM0_CSG1 PLC: PSL (Bit 10)                               */
#define HRPWM0_CSG1_PLC_PSL_Msk               (0x400UL)                 /*!< HRPWM0_CSG1 PLC: PSL (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG1_PLC_PLSW_Pos              (11UL)                    /*!< HRPWM0_CSG1 PLC: PLSW (Bit 11)                              */
#define HRPWM0_CSG1_PLC_PLSW_Msk              (0x800UL)                 /*!< HRPWM0_CSG1 PLC: PLSW (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_PLC_PLEC_Pos              (12UL)                    /*!< HRPWM0_CSG1 PLC: PLEC (Bit 12)                              */
#define HRPWM0_CSG1_PLC_PLEC_Msk              (0x3000UL)                /*!< HRPWM0_CSG1 PLC: PLEC (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG1_PLC_PLXC_Pos              (14UL)                    /*!< HRPWM0_CSG1 PLC: PLXC (Bit 14)                              */
#define HRPWM0_CSG1_PLC_PLXC_Msk              (0xc000UL)                /*!< HRPWM0_CSG1 PLC: PLXC (Bitfield-Mask: 0x03)                 */

/* -------------------------------  HRPWM0_CSG1_BLV  ------------------------------ */
#define HRPWM0_CSG1_BLV_BLV_Pos               (0UL)                     /*!< HRPWM0_CSG1 BLV: BLV (Bit 0)                                */
#define HRPWM0_CSG1_BLV_BLV_Msk               (0xffUL)                  /*!< HRPWM0_CSG1 BLV: BLV (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_CSG1_SRE  ------------------------------ */
#define HRPWM0_CSG1_SRE_VLS1E_Pos             (0UL)                     /*!< HRPWM0_CSG1 SRE: VLS1E (Bit 0)                              */
#define HRPWM0_CSG1_SRE_VLS1E_Msk             (0x1UL)                   /*!< HRPWM0_CSG1 SRE: VLS1E (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SRE_VLS2E_Pos             (1UL)                     /*!< HRPWM0_CSG1 SRE: VLS2E (Bit 1)                              */
#define HRPWM0_CSG1_SRE_VLS2E_Msk             (0x2UL)                   /*!< HRPWM0_CSG1 SRE: VLS2E (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SRE_TRGSE_Pos             (2UL)                     /*!< HRPWM0_CSG1 SRE: TRGSE (Bit 2)                              */
#define HRPWM0_CSG1_SRE_TRGSE_Msk             (0x4UL)                   /*!< HRPWM0_CSG1 SRE: TRGSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SRE_STRSE_Pos             (3UL)                     /*!< HRPWM0_CSG1 SRE: STRSE (Bit 3)                              */
#define HRPWM0_CSG1_SRE_STRSE_Msk             (0x8UL)                   /*!< HRPWM0_CSG1 SRE: STRSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SRE_STPSE_Pos             (4UL)                     /*!< HRPWM0_CSG1 SRE: STPSE (Bit 4)                              */
#define HRPWM0_CSG1_SRE_STPSE_Msk             (0x10UL)                  /*!< HRPWM0_CSG1 SRE: STPSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SRE_STDE_Pos              (5UL)                     /*!< HRPWM0_CSG1 SRE: STDE (Bit 5)                               */
#define HRPWM0_CSG1_SRE_STDE_Msk              (0x20UL)                  /*!< HRPWM0_CSG1 SRE: STDE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SRE_CRSE_Pos              (6UL)                     /*!< HRPWM0_CSG1 SRE: CRSE (Bit 6)                               */
#define HRPWM0_CSG1_SRE_CRSE_Msk              (0x40UL)                  /*!< HRPWM0_CSG1 SRE: CRSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SRE_CFSE_Pos              (7UL)                     /*!< HRPWM0_CSG1 SRE: CFSE (Bit 7)                               */
#define HRPWM0_CSG1_SRE_CFSE_Msk              (0x80UL)                  /*!< HRPWM0_CSG1 SRE: CFSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SRE_CSEE_Pos              (8UL)                     /*!< HRPWM0_CSG1 SRE: CSEE (Bit 8)                               */
#define HRPWM0_CSG1_SRE_CSEE_Msk              (0x100UL)                 /*!< HRPWM0_CSG1 SRE: CSEE (Bitfield-Mask: 0x01)                 */

/* -------------------------------  HRPWM0_CSG1_SRS  ------------------------------ */
#define HRPWM0_CSG1_SRS_VLS1S_Pos             (0UL)                     /*!< HRPWM0_CSG1 SRS: VLS1S (Bit 0)                              */
#define HRPWM0_CSG1_SRS_VLS1S_Msk             (0x3UL)                   /*!< HRPWM0_CSG1 SRS: VLS1S (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG1_SRS_VLS2S_Pos             (2UL)                     /*!< HRPWM0_CSG1 SRS: VLS2S (Bit 2)                              */
#define HRPWM0_CSG1_SRS_VLS2S_Msk             (0xcUL)                   /*!< HRPWM0_CSG1 SRS: VLS2S (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG1_SRS_TRLS_Pos              (4UL)                     /*!< HRPWM0_CSG1 SRS: TRLS (Bit 4)                               */
#define HRPWM0_CSG1_SRS_TRLS_Msk              (0x30UL)                  /*!< HRPWM0_CSG1 SRS: TRLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG1_SRS_SSLS_Pos              (6UL)                     /*!< HRPWM0_CSG1 SRS: SSLS (Bit 6)                               */
#define HRPWM0_CSG1_SRS_SSLS_Msk              (0xc0UL)                  /*!< HRPWM0_CSG1 SRS: SSLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG1_SRS_STLS_Pos              (8UL)                     /*!< HRPWM0_CSG1 SRS: STLS (Bit 8)                               */
#define HRPWM0_CSG1_SRS_STLS_Msk              (0x300UL)                 /*!< HRPWM0_CSG1 SRS: STLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG1_SRS_CRFLS_Pos             (10UL)                    /*!< HRPWM0_CSG1 SRS: CRFLS (Bit 10)                             */
#define HRPWM0_CSG1_SRS_CRFLS_Msk             (0xc00UL)                 /*!< HRPWM0_CSG1 SRS: CRFLS (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG1_SRS_CSLS_Pos              (12UL)                    /*!< HRPWM0_CSG1 SRS: CSLS (Bit 12)                              */
#define HRPWM0_CSG1_SRS_CSLS_Msk              (0x3000UL)                /*!< HRPWM0_CSG1 SRS: CSLS (Bitfield-Mask: 0x03)                 */

/* -------------------------------  HRPWM0_CSG1_SWS  ------------------------------ */
#define HRPWM0_CSG1_SWS_SVLS1_Pos             (0UL)                     /*!< HRPWM0_CSG1 SWS: SVLS1 (Bit 0)                              */
#define HRPWM0_CSG1_SWS_SVLS1_Msk             (0x1UL)                   /*!< HRPWM0_CSG1 SWS: SVLS1 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWS_SVLS2_Pos             (1UL)                     /*!< HRPWM0_CSG1 SWS: SVLS2 (Bit 1)                              */
#define HRPWM0_CSG1_SWS_SVLS2_Msk             (0x2UL)                   /*!< HRPWM0_CSG1 SWS: SVLS2 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWS_STRGS_Pos             (2UL)                     /*!< HRPWM0_CSG1 SWS: STRGS (Bit 2)                              */
#define HRPWM0_CSG1_SWS_STRGS_Msk             (0x4UL)                   /*!< HRPWM0_CSG1 SWS: STRGS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWS_SSTRS_Pos             (3UL)                     /*!< HRPWM0_CSG1 SWS: SSTRS (Bit 3)                              */
#define HRPWM0_CSG1_SWS_SSTRS_Msk             (0x8UL)                   /*!< HRPWM0_CSG1 SWS: SSTRS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWS_SSTPS_Pos             (4UL)                     /*!< HRPWM0_CSG1 SWS: SSTPS (Bit 4)                              */
#define HRPWM0_CSG1_SWS_SSTPS_Msk             (0x10UL)                  /*!< HRPWM0_CSG1 SWS: SSTPS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWS_SSTD_Pos              (5UL)                     /*!< HRPWM0_CSG1 SWS: SSTD (Bit 5)                               */
#define HRPWM0_CSG1_SWS_SSTD_Msk              (0x20UL)                  /*!< HRPWM0_CSG1 SWS: SSTD (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SWS_SCRS_Pos              (6UL)                     /*!< HRPWM0_CSG1 SWS: SCRS (Bit 6)                               */
#define HRPWM0_CSG1_SWS_SCRS_Msk              (0x40UL)                  /*!< HRPWM0_CSG1 SWS: SCRS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SWS_SCFS_Pos              (7UL)                     /*!< HRPWM0_CSG1 SWS: SCFS (Bit 7)                               */
#define HRPWM0_CSG1_SWS_SCFS_Msk              (0x80UL)                  /*!< HRPWM0_CSG1 SWS: SCFS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SWS_SCSS_Pos              (8UL)                     /*!< HRPWM0_CSG1 SWS: SCSS (Bit 8)                               */
#define HRPWM0_CSG1_SWS_SCSS_Msk              (0x100UL)                 /*!< HRPWM0_CSG1 SWS: SCSS (Bitfield-Mask: 0x01)                 */

/* -------------------------------  HRPWM0_CSG1_SWC  ------------------------------ */
#define HRPWM0_CSG1_SWC_CVLS1_Pos             (0UL)                     /*!< HRPWM0_CSG1 SWC: CVLS1 (Bit 0)                              */
#define HRPWM0_CSG1_SWC_CVLS1_Msk             (0x1UL)                   /*!< HRPWM0_CSG1 SWC: CVLS1 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWC_CVLS2_Pos             (1UL)                     /*!< HRPWM0_CSG1 SWC: CVLS2 (Bit 1)                              */
#define HRPWM0_CSG1_SWC_CVLS2_Msk             (0x2UL)                   /*!< HRPWM0_CSG1 SWC: CVLS2 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWC_CTRGS_Pos             (2UL)                     /*!< HRPWM0_CSG1 SWC: CTRGS (Bit 2)                              */
#define HRPWM0_CSG1_SWC_CTRGS_Msk             (0x4UL)                   /*!< HRPWM0_CSG1 SWC: CTRGS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWC_CSTRS_Pos             (3UL)                     /*!< HRPWM0_CSG1 SWC: CSTRS (Bit 3)                              */
#define HRPWM0_CSG1_SWC_CSTRS_Msk             (0x8UL)                   /*!< HRPWM0_CSG1 SWC: CSTRS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWC_CSTPS_Pos             (4UL)                     /*!< HRPWM0_CSG1 SWC: CSTPS (Bit 4)                              */
#define HRPWM0_CSG1_SWC_CSTPS_Msk             (0x10UL)                  /*!< HRPWM0_CSG1 SWC: CSTPS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG1_SWC_CSTD_Pos              (5UL)                     /*!< HRPWM0_CSG1 SWC: CSTD (Bit 5)                               */
#define HRPWM0_CSG1_SWC_CSTD_Msk              (0x20UL)                  /*!< HRPWM0_CSG1 SWC: CSTD (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SWC_CCRS_Pos              (6UL)                     /*!< HRPWM0_CSG1 SWC: CCRS (Bit 6)                               */
#define HRPWM0_CSG1_SWC_CCRS_Msk              (0x40UL)                  /*!< HRPWM0_CSG1 SWC: CCRS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SWC_CCFS_Pos              (7UL)                     /*!< HRPWM0_CSG1 SWC: CCFS (Bit 7)                               */
#define HRPWM0_CSG1_SWC_CCFS_Msk              (0x80UL)                  /*!< HRPWM0_CSG1 SWC: CCFS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG1_SWC_CCSS_Pos              (8UL)                     /*!< HRPWM0_CSG1 SWC: CCSS (Bit 8)                               */
#define HRPWM0_CSG1_SWC_CCSS_Msk              (0x100UL)                 /*!< HRPWM0_CSG1 SWC: CCSS (Bitfield-Mask: 0x01)                 */

/* ------------------------------  HRPWM0_CSG1_ISTAT  ----------------------------- */
#define HRPWM0_CSG1_ISTAT_VLS1S_Pos           (0UL)                     /*!< HRPWM0_CSG1 ISTAT: VLS1S (Bit 0)                            */
#define HRPWM0_CSG1_ISTAT_VLS1S_Msk           (0x1UL)                   /*!< HRPWM0_CSG1 ISTAT: VLS1S (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG1_ISTAT_VLS2S_Pos           (1UL)                     /*!< HRPWM0_CSG1 ISTAT: VLS2S (Bit 1)                            */
#define HRPWM0_CSG1_ISTAT_VLS2S_Msk           (0x2UL)                   /*!< HRPWM0_CSG1 ISTAT: VLS2S (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG1_ISTAT_TRGSS_Pos           (2UL)                     /*!< HRPWM0_CSG1 ISTAT: TRGSS (Bit 2)                            */
#define HRPWM0_CSG1_ISTAT_TRGSS_Msk           (0x4UL)                   /*!< HRPWM0_CSG1 ISTAT: TRGSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG1_ISTAT_STRSS_Pos           (3UL)                     /*!< HRPWM0_CSG1 ISTAT: STRSS (Bit 3)                            */
#define HRPWM0_CSG1_ISTAT_STRSS_Msk           (0x8UL)                   /*!< HRPWM0_CSG1 ISTAT: STRSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG1_ISTAT_STPSS_Pos           (4UL)                     /*!< HRPWM0_CSG1 ISTAT: STPSS (Bit 4)                            */
#define HRPWM0_CSG1_ISTAT_STPSS_Msk           (0x10UL)                  /*!< HRPWM0_CSG1 ISTAT: STPSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG1_ISTAT_STDS_Pos            (5UL)                     /*!< HRPWM0_CSG1 ISTAT: STDS (Bit 5)                             */
#define HRPWM0_CSG1_ISTAT_STDS_Msk            (0x20UL)                  /*!< HRPWM0_CSG1 ISTAT: STDS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG1_ISTAT_CRSS_Pos            (6UL)                     /*!< HRPWM0_CSG1 ISTAT: CRSS (Bit 6)                             */
#define HRPWM0_CSG1_ISTAT_CRSS_Msk            (0x40UL)                  /*!< HRPWM0_CSG1 ISTAT: CRSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG1_ISTAT_CFSS_Pos            (7UL)                     /*!< HRPWM0_CSG1 ISTAT: CFSS (Bit 7)                             */
#define HRPWM0_CSG1_ISTAT_CFSS_Msk            (0x80UL)                  /*!< HRPWM0_CSG1 ISTAT: CFSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG1_ISTAT_CSES_Pos            (8UL)                     /*!< HRPWM0_CSG1 ISTAT: CSES (Bit 8)                             */
#define HRPWM0_CSG1_ISTAT_CSES_Msk            (0x100UL)                 /*!< HRPWM0_CSG1 ISTAT: CSES (Bitfield-Mask: 0x01)               */


/* ================================================================================ */
/* ================      struct 'HRPWM0_CSG2' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_CSG2_DCI  ------------------------------ */
#define HRPWM0_CSG2_DCI_SVIS_Pos              (0UL)                     /*!< HRPWM0_CSG2 DCI: SVIS (Bit 0)                               */
#define HRPWM0_CSG2_DCI_SVIS_Msk              (0xfUL)                   /*!< HRPWM0_CSG2 DCI: SVIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG2_DCI_STRIS_Pos             (4UL)                     /*!< HRPWM0_CSG2 DCI: STRIS (Bit 4)                              */
#define HRPWM0_CSG2_DCI_STRIS_Msk             (0xf0UL)                  /*!< HRPWM0_CSG2 DCI: STRIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG2_DCI_STPIS_Pos             (8UL)                     /*!< HRPWM0_CSG2 DCI: STPIS (Bit 8)                              */
#define HRPWM0_CSG2_DCI_STPIS_Msk             (0xf00UL)                 /*!< HRPWM0_CSG2 DCI: STPIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG2_DCI_TRGIS_Pos             (12UL)                    /*!< HRPWM0_CSG2 DCI: TRGIS (Bit 12)                             */
#define HRPWM0_CSG2_DCI_TRGIS_Msk             (0xf000UL)                /*!< HRPWM0_CSG2 DCI: TRGIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG2_DCI_STIS_Pos              (16UL)                    /*!< HRPWM0_CSG2 DCI: STIS (Bit 16)                              */
#define HRPWM0_CSG2_DCI_STIS_Msk              (0xf0000UL)               /*!< HRPWM0_CSG2 DCI: STIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG2_DCI_SCS_Pos               (20UL)                    /*!< HRPWM0_CSG2 DCI: SCS (Bit 20)                               */
#define HRPWM0_CSG2_DCI_SCS_Msk               (0x300000UL)              /*!< HRPWM0_CSG2 DCI: SCS (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG2_IES  ------------------------------ */
#define HRPWM0_CSG2_IES_SVLS_Pos              (0UL)                     /*!< HRPWM0_CSG2 IES: SVLS (Bit 0)                               */
#define HRPWM0_CSG2_IES_SVLS_Msk              (0x3UL)                   /*!< HRPWM0_CSG2 IES: SVLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG2_IES_STRES_Pos             (2UL)                     /*!< HRPWM0_CSG2 IES: STRES (Bit 2)                              */
#define HRPWM0_CSG2_IES_STRES_Msk             (0xcUL)                   /*!< HRPWM0_CSG2 IES: STRES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG2_IES_STPES_Pos             (4UL)                     /*!< HRPWM0_CSG2 IES: STPES (Bit 4)                              */
#define HRPWM0_CSG2_IES_STPES_Msk             (0x30UL)                  /*!< HRPWM0_CSG2 IES: STPES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG2_IES_TRGES_Pos             (6UL)                     /*!< HRPWM0_CSG2 IES: TRGES (Bit 6)                              */
#define HRPWM0_CSG2_IES_TRGES_Msk             (0xc0UL)                  /*!< HRPWM0_CSG2 IES: TRGES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG2_IES_STES_Pos              (8UL)                     /*!< HRPWM0_CSG2 IES: STES (Bit 8)                               */
#define HRPWM0_CSG2_IES_STES_Msk              (0x300UL)                 /*!< HRPWM0_CSG2 IES: STES (Bitfield-Mask: 0x03)                 */

