MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4104-F64F128/mcu.h
/* -------------------------------  HRPWM0_HRC0_SC  ------------------------------- */
#define HRPWM0_HRC0_SC_ST_Pos                 (0UL)                     /*!< HRPWM0_HRC0 SC: ST (Bit 0)                                  */
#define HRPWM0_HRC0_SC_ST_Msk                 (0x1UL)                   /*!< HRPWM0_HRC0 SC: ST (Bitfield-Mask: 0x01)                    */

/* -------------------------------  HRPWM0_HRC0_DCR  ------------------------------ */
#define HRPWM0_HRC0_DCR_DTRV_Pos              (0UL)                     /*!< HRPWM0_HRC0 DCR: DTRV (Bit 0)                               */
#define HRPWM0_HRC0_DCR_DTRV_Msk              (0xffffUL)                /*!< HRPWM0_HRC0 DCR: DTRV (Bitfield-Mask: 0xffff)               */

/* -------------------------------  HRPWM0_HRC0_DCF  ------------------------------ */
#define HRPWM0_HRC0_DCF_DTFV_Pos              (0UL)                     /*!< HRPWM0_HRC0 DCF: DTFV (Bit 0)                               */
#define HRPWM0_HRC0_DCF_DTFV_Msk              (0xffffUL)                /*!< HRPWM0_HRC0 DCF: DTFV (Bitfield-Mask: 0xffff)               */

/* -------------------------------  HRPWM0_HRC0_CR1  ------------------------------ */
#define HRPWM0_HRC0_CR1_CR1_Pos               (0UL)                     /*!< HRPWM0_HRC0 CR1: CR1 (Bit 0)                                */
#define HRPWM0_HRC0_CR1_CR1_Msk               (0xffUL)                  /*!< HRPWM0_HRC0 CR1: CR1 (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_HRC0_CR2  ------------------------------ */
#define HRPWM0_HRC0_CR2_CR2_Pos               (0UL)                     /*!< HRPWM0_HRC0 CR2: CR2 (Bit 0)                                */
#define HRPWM0_HRC0_CR2_CR2_Msk               (0xffUL)                  /*!< HRPWM0_HRC0 CR2: CR2 (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_HRC0_SSC  ------------------------------ */
#define HRPWM0_HRC0_SSC_SST_Pos               (0UL)                     /*!< HRPWM0_HRC0 SSC: SST (Bit 0)                                */
#define HRPWM0_HRC0_SSC_SST_Msk               (0x1UL)                   /*!< HRPWM0_HRC0 SSC: SST (Bitfield-Mask: 0x01)                  */

/* ------------------------------  HRPWM0_HRC0_SDCR  ------------------------------ */
#define HRPWM0_HRC0_SDCR_SDTRV_Pos            (0UL)                     /*!< HRPWM0_HRC0 SDCR: SDTRV (Bit 0)                             */
#define HRPWM0_HRC0_SDCR_SDTRV_Msk            (0xffffUL)                /*!< HRPWM0_HRC0 SDCR: SDTRV (Bitfield-Mask: 0xffff)             */

/* ------------------------------  HRPWM0_HRC0_SDCF  ------------------------------ */
#define HRPWM0_HRC0_SDCF_SDTFV_Pos            (0UL)                     /*!< HRPWM0_HRC0 SDCF: SDTFV (Bit 0)                             */
#define HRPWM0_HRC0_SDCF_SDTFV_Msk            (0xffffUL)                /*!< HRPWM0_HRC0 SDCF: SDTFV (Bitfield-Mask: 0xffff)             */

/* ------------------------------  HRPWM0_HRC0_SCR1  ------------------------------ */
#define HRPWM0_HRC0_SCR1_SCR1_Pos             (0UL)                     /*!< HRPWM0_HRC0 SCR1: SCR1 (Bit 0)                              */
#define HRPWM0_HRC0_SCR1_SCR1_Msk             (0xffUL)                  /*!< HRPWM0_HRC0 SCR1: SCR1 (Bitfield-Mask: 0xff)                */

/* ------------------------------  HRPWM0_HRC0_SCR2  ------------------------------ */
#define HRPWM0_HRC0_SCR2_SCR2_Pos             (0UL)                     /*!< HRPWM0_HRC0 SCR2: SCR2 (Bit 0)                              */
#define HRPWM0_HRC0_SCR2_SCR2_Msk             (0xffUL)                  /*!< HRPWM0_HRC0 SCR2: SCR2 (Bitfield-Mask: 0xff)                */


/* ================================================================================ */
/* ================      struct 'HRPWM0_HRC1' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_HRC1_GC  ------------------------------- */
#define HRPWM0_HRC1_GC_HRM0_Pos               (0UL)                     /*!< HRPWM0_HRC1 GC: HRM0 (Bit 0)                                */
#define HRPWM0_HRC1_GC_HRM0_Msk               (0x3UL)                   /*!< HRPWM0_HRC1 GC: HRM0 (Bitfield-Mask: 0x03)                  */
#define HRPWM0_HRC1_GC_HRM1_Pos               (2UL)                     /*!< HRPWM0_HRC1 GC: HRM1 (Bit 2)                                */
#define HRPWM0_HRC1_GC_HRM1_Msk               (0xcUL)                   /*!< HRPWM0_HRC1 GC: HRM1 (Bitfield-Mask: 0x03)                  */
#define HRPWM0_HRC1_GC_DTE_Pos                (8UL)                     /*!< HRPWM0_HRC1 GC: DTE (Bit 8)                                 */
#define HRPWM0_HRC1_GC_DTE_Msk                (0x100UL)                 /*!< HRPWM0_HRC1 GC: DTE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC1_GC_TR0E_Pos               (9UL)                     /*!< HRPWM0_HRC1 GC: TR0E (Bit 9)                                */
#define HRPWM0_HRC1_GC_TR0E_Msk               (0x200UL)                 /*!< HRPWM0_HRC1 GC: TR0E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC1_GC_TR1E_Pos               (10UL)                    /*!< HRPWM0_HRC1 GC: TR1E (Bit 10)                               */
#define HRPWM0_HRC1_GC_TR1E_Msk               (0x400UL)                 /*!< HRPWM0_HRC1 GC: TR1E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC1_GC_STC_Pos                (11UL)                    /*!< HRPWM0_HRC1 GC: STC (Bit 11)                                */
#define HRPWM0_HRC1_GC_STC_Msk                (0x800UL)                 /*!< HRPWM0_HRC1 GC: STC (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC1_GC_DSTC_Pos               (12UL)                    /*!< HRPWM0_HRC1 GC: DSTC (Bit 12)                               */
#define HRPWM0_HRC1_GC_DSTC_Msk               (0x1000UL)                /*!< HRPWM0_HRC1 GC: DSTC (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC1_GC_OCS0_Pos               (13UL)                    /*!< HRPWM0_HRC1 GC: OCS0 (Bit 13)                               */
#define HRPWM0_HRC1_GC_OCS0_Msk               (0x2000UL)                /*!< HRPWM0_HRC1 GC: OCS0 (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC1_GC_OCS1_Pos               (14UL)                    /*!< HRPWM0_HRC1 GC: OCS1 (Bit 14)                               */
#define HRPWM0_HRC1_GC_OCS1_Msk               (0x4000UL)                /*!< HRPWM0_HRC1 GC: OCS1 (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC1_GC_DTUS_Pos               (16UL)                    /*!< HRPWM0_HRC1 GC: DTUS (Bit 16)                               */
#define HRPWM0_HRC1_GC_DTUS_Msk               (0x10000UL)               /*!< HRPWM0_HRC1 GC: DTUS (Bitfield-Mask: 0x01)                  */

/* -------------------------------  HRPWM0_HRC1_PL  ------------------------------- */
#define HRPWM0_HRC1_PL_PSL0_Pos               (0UL)                     /*!< HRPWM0_HRC1 PL: PSL0 (Bit 0)                                */
#define HRPWM0_HRC1_PL_PSL0_Msk               (0x1UL)                   /*!< HRPWM0_HRC1 PL: PSL0 (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC1_PL_PSL1_Pos               (1UL)                     /*!< HRPWM0_HRC1 PL: PSL1 (Bit 1)                                */
#define HRPWM0_HRC1_PL_PSL1_Msk               (0x2UL)                   /*!< HRPWM0_HRC1 PL: PSL1 (Bitfield-Mask: 0x01)                  */

/* ------------------------------  HRPWM0_HRC1_GSEL  ------------------------------ */
#define HRPWM0_HRC1_GSEL_C0SS_Pos             (0UL)                     /*!< HRPWM0_HRC1 GSEL: C0SS (Bit 0)                              */
#define HRPWM0_HRC1_GSEL_C0SS_Msk             (0x7UL)                   /*!< HRPWM0_HRC1 GSEL: C0SS (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC1_GSEL_C0CS_Pos             (3UL)                     /*!< HRPWM0_HRC1 GSEL: C0CS (Bit 3)                              */
#define HRPWM0_HRC1_GSEL_C0CS_Msk             (0x38UL)                  /*!< HRPWM0_HRC1 GSEL: C0CS (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC1_GSEL_S0M_Pos              (6UL)                     /*!< HRPWM0_HRC1 GSEL: S0M (Bit 6)                               */
#define HRPWM0_HRC1_GSEL_S0M_Msk              (0xc0UL)                  /*!< HRPWM0_HRC1 GSEL: S0M (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC1_GSEL_C0M_Pos              (8UL)                     /*!< HRPWM0_HRC1 GSEL: C0M (Bit 8)                               */
#define HRPWM0_HRC1_GSEL_C0M_Msk              (0x300UL)                 /*!< HRPWM0_HRC1 GSEL: C0M (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC1_GSEL_S0ES_Pos             (10UL)                    /*!< HRPWM0_HRC1 GSEL: S0ES (Bit 10)                             */
#define HRPWM0_HRC1_GSEL_S0ES_Msk             (0xc00UL)                 /*!< HRPWM0_HRC1 GSEL: S0ES (Bitfield-Mask: 0x03)                */
#define HRPWM0_HRC1_GSEL_C0ES_Pos             (12UL)                    /*!< HRPWM0_HRC1 GSEL: C0ES (Bit 12)                             */
#define HRPWM0_HRC1_GSEL_C0ES_Msk             (0x3000UL)                /*!< HRPWM0_HRC1 GSEL: C0ES (Bitfield-Mask: 0x03)                */
#define HRPWM0_HRC1_GSEL_C1SS_Pos             (16UL)                    /*!< HRPWM0_HRC1 GSEL: C1SS (Bit 16)                             */
#define HRPWM0_HRC1_GSEL_C1SS_Msk             (0x70000UL)               /*!< HRPWM0_HRC1 GSEL: C1SS (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC1_GSEL_C1CS_Pos             (19UL)                    /*!< HRPWM0_HRC1 GSEL: C1CS (Bit 19)                             */
#define HRPWM0_HRC1_GSEL_C1CS_Msk             (0x380000UL)              /*!< HRPWM0_HRC1 GSEL: C1CS (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC1_GSEL_S1M_Pos              (22UL)                    /*!< HRPWM0_HRC1 GSEL: S1M (Bit 22)                              */
#define HRPWM0_HRC1_GSEL_S1M_Msk              (0xc00000UL)              /*!< HRPWM0_HRC1 GSEL: S1M (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC1_GSEL_C1M_Pos              (24UL)                    /*!< HRPWM0_HRC1 GSEL: C1M (Bit 24)                              */
#define HRPWM0_HRC1_GSEL_C1M_Msk              (0x3000000UL)             /*!< HRPWM0_HRC1 GSEL: C1M (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC1_GSEL_S1ES_Pos             (26UL)                    /*!< HRPWM0_HRC1 GSEL: S1ES (Bit 26)                             */
#define HRPWM0_HRC1_GSEL_S1ES_Msk             (0xc000000UL)             /*!< HRPWM0_HRC1 GSEL: S1ES (Bitfield-Mask: 0x03)                */
#define HRPWM0_HRC1_GSEL_C1ES_Pos             (28UL)                    /*!< HRPWM0_HRC1 GSEL: C1ES (Bit 28)                             */
#define HRPWM0_HRC1_GSEL_C1ES_Msk             (0x30000000UL)            /*!< HRPWM0_HRC1 GSEL: C1ES (Bitfield-Mask: 0x03)                */

/* ------------------------------  HRPWM0_HRC1_TSEL  ------------------------------ */
#define HRPWM0_HRC1_TSEL_TSEL0_Pos            (0UL)                     /*!< HRPWM0_HRC1 TSEL: TSEL0 (Bit 0)                             */
#define HRPWM0_HRC1_TSEL_TSEL0_Msk            (0x7UL)                   /*!< HRPWM0_HRC1 TSEL: TSEL0 (Bitfield-Mask: 0x07)               */
#define HRPWM0_HRC1_TSEL_TSEL1_Pos            (3UL)                     /*!< HRPWM0_HRC1 TSEL: TSEL1 (Bit 3)                             */
#define HRPWM0_HRC1_TSEL_TSEL1_Msk            (0x38UL)                  /*!< HRPWM0_HRC1 TSEL: TSEL1 (Bitfield-Mask: 0x07)               */
#define HRPWM0_HRC1_TSEL_TS0E_Pos             (16UL)                    /*!< HRPWM0_HRC1 TSEL: TS0E (Bit 16)                             */
#define HRPWM0_HRC1_TSEL_TS0E_Msk             (0x10000UL)               /*!< HRPWM0_HRC1 TSEL: TS0E (Bitfield-Mask: 0x01)                */
#define HRPWM0_HRC1_TSEL_TS1E_Pos             (17UL)                    /*!< HRPWM0_HRC1 TSEL: TS1E (Bit 17)                             */
#define HRPWM0_HRC1_TSEL_TS1E_Msk             (0x20000UL)               /*!< HRPWM0_HRC1 TSEL: TS1E (Bitfield-Mask: 0x01)                */

/* -------------------------------  HRPWM0_HRC1_SC  ------------------------------- */
#define HRPWM0_HRC1_SC_ST_Pos                 (0UL)                     /*!< HRPWM0_HRC1 SC: ST (Bit 0)                                  */
#define HRPWM0_HRC1_SC_ST_Msk                 (0x1UL)                   /*!< HRPWM0_HRC1 SC: ST (Bitfield-Mask: 0x01)                    */

/* -------------------------------  HRPWM0_HRC1_DCR  ------------------------------ */
#define HRPWM0_HRC1_DCR_DTRV_Pos              (0UL)                     /*!< HRPWM0_HRC1 DCR: DTRV (Bit 0)                               */
#define HRPWM0_HRC1_DCR_DTRV_Msk              (0xffffUL)                /*!< HRPWM0_HRC1 DCR: DTRV (Bitfield-Mask: 0xffff)               */

/* -------------------------------  HRPWM0_HRC1_DCF  ------------------------------ */
#define HRPWM0_HRC1_DCF_DTFV_Pos              (0UL)                     /*!< HRPWM0_HRC1 DCF: DTFV (Bit 0)                               */
#define HRPWM0_HRC1_DCF_DTFV_Msk              (0xffffUL)                /*!< HRPWM0_HRC1 DCF: DTFV (Bitfield-Mask: 0xffff)               */

/* -------------------------------  HRPWM0_HRC1_CR1  ------------------------------ */
#define HRPWM0_HRC1_CR1_CR1_Pos               (0UL)                     /*!< HRPWM0_HRC1 CR1: CR1 (Bit 0)                                */
#define HRPWM0_HRC1_CR1_CR1_Msk               (0xffUL)                  /*!< HRPWM0_HRC1 CR1: CR1 (Bitfield-Mask: 0xff)                  */

