MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4104-F64F128/mcu.h
/* ------------------------------  HRPWM0_HRC3_GSEL  ------------------------------ */
#define HRPWM0_HRC3_GSEL_C0SS_Pos             (0UL)                     /*!< HRPWM0_HRC3 GSEL: C0SS (Bit 0)                              */
#define HRPWM0_HRC3_GSEL_C0SS_Msk             (0x7UL)                   /*!< HRPWM0_HRC3 GSEL: C0SS (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC3_GSEL_C0CS_Pos             (3UL)                     /*!< HRPWM0_HRC3 GSEL: C0CS (Bit 3)                              */
#define HRPWM0_HRC3_GSEL_C0CS_Msk             (0x38UL)                  /*!< HRPWM0_HRC3 GSEL: C0CS (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC3_GSEL_S0M_Pos              (6UL)                     /*!< HRPWM0_HRC3 GSEL: S0M (Bit 6)                               */
#define HRPWM0_HRC3_GSEL_S0M_Msk              (0xc0UL)                  /*!< HRPWM0_HRC3 GSEL: S0M (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC3_GSEL_C0M_Pos              (8UL)                     /*!< HRPWM0_HRC3 GSEL: C0M (Bit 8)                               */
#define HRPWM0_HRC3_GSEL_C0M_Msk              (0x300UL)                 /*!< HRPWM0_HRC3 GSEL: C0M (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC3_GSEL_S0ES_Pos             (10UL)                    /*!< HRPWM0_HRC3 GSEL: S0ES (Bit 10)                             */
#define HRPWM0_HRC3_GSEL_S0ES_Msk             (0xc00UL)                 /*!< HRPWM0_HRC3 GSEL: S0ES (Bitfield-Mask: 0x03)                */
#define HRPWM0_HRC3_GSEL_C0ES_Pos             (12UL)                    /*!< HRPWM0_HRC3 GSEL: C0ES (Bit 12)                             */
#define HRPWM0_HRC3_GSEL_C0ES_Msk             (0x3000UL)                /*!< HRPWM0_HRC3 GSEL: C0ES (Bitfield-Mask: 0x03)                */
#define HRPWM0_HRC3_GSEL_C1SS_Pos             (16UL)                    /*!< HRPWM0_HRC3 GSEL: C1SS (Bit 16)                             */
#define HRPWM0_HRC3_GSEL_C1SS_Msk             (0x70000UL)               /*!< HRPWM0_HRC3 GSEL: C1SS (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC3_GSEL_C1CS_Pos             (19UL)                    /*!< HRPWM0_HRC3 GSEL: C1CS (Bit 19)                             */
#define HRPWM0_HRC3_GSEL_C1CS_Msk             (0x380000UL)              /*!< HRPWM0_HRC3 GSEL: C1CS (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC3_GSEL_S1M_Pos              (22UL)                    /*!< HRPWM0_HRC3 GSEL: S1M (Bit 22)                              */
#define HRPWM0_HRC3_GSEL_S1M_Msk              (0xc00000UL)              /*!< HRPWM0_HRC3 GSEL: S1M (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC3_GSEL_C1M_Pos              (24UL)                    /*!< HRPWM0_HRC3 GSEL: C1M (Bit 24)                              */
#define HRPWM0_HRC3_GSEL_C1M_Msk              (0x3000000UL)             /*!< HRPWM0_HRC3 GSEL: C1M (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC3_GSEL_S1ES_Pos             (26UL)                    /*!< HRPWM0_HRC3 GSEL: S1ES (Bit 26)                             */
#define HRPWM0_HRC3_GSEL_S1ES_Msk             (0xc000000UL)             /*!< HRPWM0_HRC3 GSEL: S1ES (Bitfield-Mask: 0x03)                */
#define HRPWM0_HRC3_GSEL_C1ES_Pos             (28UL)                    /*!< HRPWM0_HRC3 GSEL: C1ES (Bit 28)                             */
#define HRPWM0_HRC3_GSEL_C1ES_Msk             (0x30000000UL)            /*!< HRPWM0_HRC3 GSEL: C1ES (Bitfield-Mask: 0x03)                */

/* ------------------------------  HRPWM0_HRC3_TSEL  ------------------------------ */
#define HRPWM0_HRC3_TSEL_TSEL0_Pos            (0UL)                     /*!< HRPWM0_HRC3 TSEL: TSEL0 (Bit 0)                             */
#define HRPWM0_HRC3_TSEL_TSEL0_Msk            (0x7UL)                   /*!< HRPWM0_HRC3 TSEL: TSEL0 (Bitfield-Mask: 0x07)               */
#define HRPWM0_HRC3_TSEL_TSEL1_Pos            (3UL)                     /*!< HRPWM0_HRC3 TSEL: TSEL1 (Bit 3)                             */
#define HRPWM0_HRC3_TSEL_TSEL1_Msk            (0x38UL)                  /*!< HRPWM0_HRC3 TSEL: TSEL1 (Bitfield-Mask: 0x07)               */
#define HRPWM0_HRC3_TSEL_TS0E_Pos             (16UL)                    /*!< HRPWM0_HRC3 TSEL: TS0E (Bit 16)                             */
#define HRPWM0_HRC3_TSEL_TS0E_Msk             (0x10000UL)               /*!< HRPWM0_HRC3 TSEL: TS0E (Bitfield-Mask: 0x01)                */
#define HRPWM0_HRC3_TSEL_TS1E_Pos             (17UL)                    /*!< HRPWM0_HRC3 TSEL: TS1E (Bit 17)                             */
#define HRPWM0_HRC3_TSEL_TS1E_Msk             (0x20000UL)               /*!< HRPWM0_HRC3 TSEL: TS1E (Bitfield-Mask: 0x01)                */

/* -------------------------------  HRPWM0_HRC3_SC  ------------------------------- */
#define HRPWM0_HRC3_SC_ST_Pos                 (0UL)                     /*!< HRPWM0_HRC3 SC: ST (Bit 0)                                  */
#define HRPWM0_HRC3_SC_ST_Msk                 (0x1UL)                   /*!< HRPWM0_HRC3 SC: ST (Bitfield-Mask: 0x01)                    */

/* -------------------------------  HRPWM0_HRC3_DCR  ------------------------------ */
#define HRPWM0_HRC3_DCR_DTRV_Pos              (0UL)                     /*!< HRPWM0_HRC3 DCR: DTRV (Bit 0)                               */
#define HRPWM0_HRC3_DCR_DTRV_Msk              (0xffffUL)                /*!< HRPWM0_HRC3 DCR: DTRV (Bitfield-Mask: 0xffff)               */

/* -------------------------------  HRPWM0_HRC3_DCF  ------------------------------ */
#define HRPWM0_HRC3_DCF_DTFV_Pos              (0UL)                     /*!< HRPWM0_HRC3 DCF: DTFV (Bit 0)                               */
#define HRPWM0_HRC3_DCF_DTFV_Msk              (0xffffUL)                /*!< HRPWM0_HRC3 DCF: DTFV (Bitfield-Mask: 0xffff)               */

/* -------------------------------  HRPWM0_HRC3_CR1  ------------------------------ */
#define HRPWM0_HRC3_CR1_CR1_Pos               (0UL)                     /*!< HRPWM0_HRC3 CR1: CR1 (Bit 0)                                */
#define HRPWM0_HRC3_CR1_CR1_Msk               (0xffUL)                  /*!< HRPWM0_HRC3 CR1: CR1 (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_HRC3_CR2  ------------------------------ */
#define HRPWM0_HRC3_CR2_CR2_Pos               (0UL)                     /*!< HRPWM0_HRC3 CR2: CR2 (Bit 0)                                */
#define HRPWM0_HRC3_CR2_CR2_Msk               (0xffUL)                  /*!< HRPWM0_HRC3 CR2: CR2 (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_HRC3_SSC  ------------------------------ */
#define HRPWM0_HRC3_SSC_SST_Pos               (0UL)                     /*!< HRPWM0_HRC3 SSC: SST (Bit 0)                                */
#define HRPWM0_HRC3_SSC_SST_Msk               (0x1UL)                   /*!< HRPWM0_HRC3 SSC: SST (Bitfield-Mask: 0x01)                  */

